In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('submissions_data_train.csv')

In [3]:
df.head()

   step_id   timestamp submission_status  user_id
0    31971  1434349275           correct    15853
1    31972  1434348300           correct    15853
2    31972  1478852149             wrong    15853
3    31972  1478852164           correct    15853
4    31976  1434348123             wrong    15853

In [4]:
df["date"] = pd.to_datetime(df.timestamp, unit='s')

In [5]:
df["day"] = df.date.dt.date

In [6]:
df.head()

,step_id,timestamp,submission_status,user_id,date,day
0,31971,1434349275,correct,15853,2015-06-15 06:21:15,2015-06-15
1,31972,1434348300,correct,15853,2015-06-15 06:05:00,2015-06-15
2,31972,1478852149,wrong,15853,2016-11-11 08:15:49,2016-11-11
3,31972,1478852164,correct,15853,2016-11-11 08:16:04,2016-11-11
4,31976,1434348123,wrong,15853,2015-06-15 06:02:03,2015-06-15

In [14]:
df = df.merge(df.groupby('user_id', as_index=False).agg({'submission_status': 'count'}).rename(columns={'submission_status': 'submissions_count'}), how='outer')

In [25]:
df.groupby('user_id').day.nunique().to_frame().sort_values(by='day', ascending=False).head()

         day
user_id
1046      87
3572      51
6662      51
11651     51
17825     50

In [ ]:
df.groupby('user_id').day.nunique().to_frame().sort_values(by='day', ascending=False).head()